Repository: INFORMATICS-SYSTEMS/garnenterprise.com
Catalog: var/langs/*/addons/access_restrictions.po
Languages: th_th

# Addons::name::access_restrictions
source: Access restrictions
th_th: การจำกัดการเข้าถึง

# Addons::description::access_restrictions
source: Lets you limit storefront and administrator area access to certain IP-addresses with different options
th_th: ช่วยให้คุณสามารถจำกัดการเข้าพื้นที่หน้าร้านและผู้ดูแลถึงบางที่อยู่ IP กับตัวเลือกต่าง ๆ

# Languages::access_restrictions
source: Access restrictions
th_th: การจำกัดการเข้าถึง

# Languages::add_ips
source: Add IPs
th_th: เพิ่ม IP

# Languages::new_ips
source: New IPs
th_th: IP ใหม่

# Languages::add_domains
source: Add domains
th_th: เพิ่มโดเมน

# Languages::new_domains
source: New domains
th_th: โดเมนใหม่

# Languages::add_emails
source: Add e-mail addresses
th_th: เพิ่มอีเมลใหม่

# Languages::new_emails
source: New e-mail addresses
th_th: อีเมลใหม่

# Languages::new_credit_card
source: New credit card
th_th: เครดิตการ์ดใบใหม่

# Languages::add_credit_card
source: Add credit card
th_th: เพิ่มเครดิตการ์ด

# Languages::domain
source: Domain
th_th: โดเมน

# Languages::warning_of_ip_adding
source: The entered IP address <b>[entered_ip]</b> forbids access to the administration panel from your computer (your IP is <b>[your_ip]</b>).
th_th: ใส่ IP ที่อยู่<b>[entered_ip]</b> ห้ามเข้าไปยังแผงบริหารจากคอมพิวเตอร์ของคุณ (IP ของคุณคือ <b>[your_ip]</b>)

# Languages::text_cc_number_is_blocked
source: The credit card number <b>[cc_number]</b> is blocked by the administrator. Please contact the store administrator or try another one.
th_th: หมายเลขบัตรเครดิต <b>[cc_number]</b> ถูกบล็อค โดยผู้ดูแลระบบ กรุณาติดต่อผู้ดูแลร้าน หรือลองอีกหนึ่ง

# Languages::text_not_valid_ip
source: <b>[ip]</b> is not a valid ip address.
th_th: <b>[ip]</b> ไม่มีที่อยู่ ip ที่ถูกต้อง

# Languages::text_not_valid_domain
source: <b>[domain]</b> is not a valid domain name.
th_th: <b>[domain]</b> ไม่มีชื่อโดเมนที่ถูกต้อง

# Languages::text_not_valid_cc_number
source: <b>[cc_number]</b> is not a valid credit card number.
th_th: <b>[cc_number]</b> ไม่ใช่หมายเลขบัตรเครดิต

# Languages::text_email_is_blocked
source: The e-mail address <b>[email]</b> is blocked by the administrator. Please contact the store administrator or try another one.
th_th: ที่อยู่อีเมลที่ <b>[email]</b> ถูกบล็อค โดยผู้ดูแลระบบ กรุณาติดต่อผู้ดูแลร้าน หรือลองอีกหนึ่ง

# Languages::text_ips_denied
source: You are not allowed to access this area
th_th: คุณไม่สามารถเข้าถึงพื้นที่นี้

# Languages::text_ip_blocked_failed_login
source: The IP was blocked after [number] unsuccessful logins
th_th: ถูกบล็อค IP หลังจากล็อกอินสำเร็จ [number]

# Languages::text_ip_is_blocked
source: Your IP address is blocked.
th_th: Ip ของคุณถูกบล็อค

# Languages::store_admin
source: Store administrator
th_th: ผู้ดูแลร้าน

# Languages::your_ip_added
source: Your IP address <b>[ip]</b> has been added to the access restrictions table.
th_th: ของคุณที่อยู่ IP <b>[ip]</b> มีการเพิ่มการเข้าถึงข้อจำกัดตาราง

# Languages::your_ip_enabled
source: Your IP address <b>[ip]</b> has been enabled in the access restrictions table.
th_th: ของคุณที่อยู่ IP <b>[ip]</b> มีการเพิ่มการเข้าถึงข้อจำกัดตาราง

# Languages::your_ip_removed
source: Your IP address <b>[ip]</b> has been removed from the access restrictions table.
th_th: ของคุณที่อยู่ IP <b>[ip]</b> มีการเพิ่มการเข้าถึงข้อจำกัดตาราง

# Languages::ip_from
source: IP from
th_th: IP จาก

# Languages::ip_to
source: IP to
th_th: IP จะ

# Languages::text_access_notice
source: You can use the wildcards for the "Domain", "E-mail" and "Credit Card" tabs: <br /><b>*</b> - can represent any number of characters, including zero<br /><b>?</b> - can represent any single character.
th_th: คุณสามารถใช้อักขระตัวแทนที่แท็บ "โดเมน" "อีเมล" และ "บัตรเครดิต": < br / > <b> * </b> - สามารถแสดงหมายเลขใด ๆ ของอักขระ รวมศูนย์ < br / > <b>?</b> - สามารถแสดงอักขระได้

# Languages::make_permanent
source: Make permanent
th_th: ทำให้ถาวร

# Languages::credit_card_number
source: Credit card number
th_th: หมายเลขบัตรเครดิต

# SettingsSections::access_restrictions::general
source: General
th_th: ทั่วไป

# SettingsOptions::access_restrictions::elm_administrator_area_settings
source: Administrator area settings
th_th: การตั้งค่าพื้นที่ของผู้ดูแลระบบ

# SettingsOptions::access_restrictions::admin_reverse_ip_access
source: Allow login to the admin area from specified IPs only
th_th: อนุญาตให้เข้าสู่การตั้ง admin จาก IPs ที่ระบุเท่านั้น

# SettingsOptions::access_restrictions::unsuccessful_attempts_login
source: Block IP after a number of unsuccessful attempts
th_th: บล็อก IP หลังจากจำนวนของความพยายาม

# SettingsOptions::access_restrictions::number_unsuccessful_attempts
source: Number of unsuccessful attempts
th_th: จำนวนความพยายามที่ไม่ประสบความสำเร็จ

# SettingsOptions::access_restrictions::login_intervals
source: Time between unsuccessful login attempts (seconds)
th_th: เวลาระหว่างความพยายามเข้าสู่ระบบไม่สำเร็จ (วินาที)

# SettingsOptions::access_restrictions::time_block
source: Time for which the IP should be blocked (hours)
th_th: เวลาที่ IP ควรจะถูกบล็อค (ชั่วโมง)

# SettingsOptions::access_restrictions::elm_customer_and_affiliate_area_settings
source: Customer area settings
th_th: การตั้งค่าพื้นที่ของลูกค้า

# SettingsOptions::access_restrictions::unsuccessful_attempts_login_customer
source: Block IP after a number of unsuccessful attempts
th_th: บล็อก IP หลังจากจำนวนของความพยายาม

# SettingsOptions::access_restrictions::number_unsuccessful_attempts_customer
source: Number of unsuccessful attempts
th_th: จำนวนความพยายามที่ไม่ประสบความสำเร็จ

# SettingsOptions::access_restrictions::login_intervals_customer
source: Time between unsuccessful login attempts (seconds)
th_th: เวลาระหว่างความพยายามเข้าสู่ระบบไม่สำเร็จ (วินาที)

# SettingsOptions::access_restrictions::time_block_customer
source: Time for which the IP should be blocked (hours)
th_th: เวลาที่ IP ควรจะถูกบล็อค (ชั่วโมง)
