Repository: INFORMATICS-SYSTEMS/garnenterprise.com
Catalog: var/langs/*/addons/backend_google_auth.po
Languages: th_th

# SettingsOptions::backend_google_auth::backend_google_auth_client_id
source: Client ID
th_th: Klienta ID

# SettingsOptions::backend_google_auth::backend_google_auth_client_secret
source: Client secret
th_th: Klienta noslēpumatslēga

# Languages::backend_google_auth.user_not_found
source: The <strong>[user]</strong> user not found
th_th: Lietotājs <strong>[user]</strong> nav atrasts

# Languages::backend_google_auth.settings.warning
source: Once you configure this add-on, only administrators with Gmail email addresses will be able to sign in to the Administration panel. If your administrators have non-Google email addresses specified, don't configure the add-on, or else those administrators won't be able to sign in.
th_th: לאחר שתגדיר את התוספת הזו, רק מנהלי מערכת עם כתובות דוא"ל של Gmail יוכלו להיכנס לחלונית 'ניהול'. אם מנהלי המערכת שלך מציינים כתובות דוא"ל שאינן של Google, אל תגדיר את התוסף, אחרת מנהלי המערכת לא יוכלו להיכנס.

# Languages::backend_google_auth.settings.create_new_application
source: To acquire your client ID and secret create a new application in your Google APIs account.
th_th: Para adquirir su ID de cliente y su secreto cree una nueva aplicación en su cuenta de API de Google.

# Languages::backend_google_auth.settings.learn_more_about
source: Learn more about Google APIs
th_th: Obtenga más información sobre las API de Google

# Languages::backend_google_auth.settings.provide_your_credentials
source: Please provide your Google API credentials
th_th: Por favor, proporcione sus credenciales de la API de Google

# Languages::backend_google_auth.settings.authorized_redirect_uris
source: Your authorized redirect URIs:
th_th: Atļautie novirzīšanas URI ir:

# Languages::backend_google_auth.settings.save_and_check_btn
source: Save and test the sign-in
th_th: Simpan dan uji tombol masuk

# Languages::backend_google_auth.errors.not_configured
source: Please configure the add-on first
th_th: Silakan konfigurasikan tombol tambahan dahulu

# Languages::backend_google_auth.warnings.only_gmail_address_is_available_to_auth
source: The "Back-End Sign-In via Google" add-on is active. Only administrators with Gmail email addresses will be able to sign in.
th_th: התוסף 'כניסה באמצעות סיום כניסה באמצעות Google' פעיל. רק מנהלי מערכת עם כתובות דוא"ל של Gmail יוכלו להיכנס.

# Languages::backend_google_auth.login_page.help
source: Please select the email address that was specified for your administrator account.
th_th: Lūdzu, norādiet e-pasta adresi, kas tika piešķirta jūsu administratora kontam.
