Repository: INFORMATICS-SYSTEMS/garnenterprise.com
Catalog: var/langs/*/addons/banners.po
Languages: th_th

# Addons::name::banners
source: Banners management
th_th: Управление на банери

# Languages::add_banner
source: Add banner
th_th: เพิ่มแบนเนอร์

# Languages::banner
source: Banner
th_th: แบนเนอร์

# Languages::banners
source: Banners
th_th: แบนเนอร์หลายตัว

# Languages::banners_menu_description
source: Create graphic and text banners that can then be placed on the storefront.
th_th: สร้างแบนเนอร์กราฟิกและข้อความที่สามารถวางบนหน้าร้านแล้ว

# Languages::banner_code
source: Banner code
th_th: โค้ดแบนเนอร์

# Languages::banner_code_for_some_products
source: Banner code for some products
th_th: โค้ดแบนเนอร์สำหรับผลิตภัณฑ์บางอย่าง

# Languages::manage_banners
source: Manage banners
th_th: จัดการแบนเนอร์

# Languages::block_banners
source: Banners
th_th: แบนเนอร์หลายตัว

# Languages::block_banners_description
source: Visual and text banners
th_th: แบนเนอร์ภาพและข้อความ

# Languages::privileges.manage_banners
source: Can edit
th_th: Peut éditer

# Languages::privilege_groups.banners
source: Banners
th_th: แบนเนอร์

# Languages::add_banners
source: Add banners
th_th: เพิ่มแบนเนอร์

# Languages::add_banners_and_close
source: Add banners and close
th_th: เพิ่มแบนเนอร์ และปิด

# Languages::graphic_banner
source: Graphic banner
th_th: แบนเนอร์กราฟิก

# Languages::text_banner
source: Text banner
th_th: ข้อความแบนเนอร์

# Languages::views
source: Views
th_th: มุมมอง

# Languages::conversion
source: Conversion
th_th: การแปลง

# Languages::banner_details_notes
source: After you create a banner here, you should use the <strong>Layout editor</strong> to add it to the storefront.<br /><br />Go to <a href="[layouts_href]" target="_blank">Design → Layouts</a>, switch to the location where you want the banner to appear, and add a new block with type <strong>Banners</strong>.<br /><br />In this block settings, go to the <strong>Content</strong> tab, pick the <strong>Manual</strong> filling, and click on the <strong>Add banners</strong> button.<br /><br />You will see the list of all the banners in your store. Pick the one(s) you need and click on the <strong>Add banners and close</strong> button.<br /><br />Finally, click on the <strong>Create</strong> button to save your changes.
th_th: หลังจากคุณสร้างแบนเนอร์ที่นี่ คุณควรใช้<strong>แก้ไขเค้าโครง</strong>เพื่อเพิ่มหน้าร้าน. < br / > < br / > ไปการ<a href="[layouts_href]" target="_blank">ออกแบบรูปแบบ→</a> สลับไปยังตำแหน่งที่คุณต้องการแบนเนอร์ปรากฏ เพิ่มบล็อกใหม่ชนิด<strong>แบนเนอร์</strong>. < br / > < br / > ในนี้ บล็อกการตั้งค่า ไปที่แท็บ<strong>เนื้อหา</strong> รับบรรจุ<strong>คู่มือ</strong> และคลิกที่ปุ่ม<strong>เพิ่มแบนเนอร์</strong>. < br / > < br / > คุณจะเห็นรายการของแบนเนอร์ทั้งหมดในร้านค้าของคุณ รับ one(s) ที่คุณต้องการ และคลิกที่การ<strong>เพิ่มแบนเนอร์ และปิด</strong>ปุ่ม. < br / > < br / > คลิกที่ปุ่ม<strong>สร้าง</strong>เพื่อบันทึกการเปลี่ยนแปลง

# SettingsSections::banners::general
source: General
th_th: ทั่วไป

# SettingsOptions::banners::banner_multilang
source: Enable multi-language Images/URLs
th_th: เปิดใช้งานหลายภาษา ภาพ/Url
