Repository: INFORMATICS-SYSTEMS/garnenterprise.com
Catalog: var/langs/*/addons/barcode.po
Languages: th_th

# Addons::name::barcode
source: Order barcode
th_th: บาร์โค้ดของการสั่งซื้อ

# Addons::description::barcode
source: Makes it possible to configure and attach barcodes to orders
th_th: ทำให้สามารถกำหนดค่า และแนบบาร์โค้ดในใบสั่ง

# Languages::please_enable_the_add_on_to_see_barcode
source: Please enable the add-on to see a code example.
th_th: กรุณาเปิดใช้งาน add-on เพื่อดูตัวอย่างรหัส

# SettingsSections::barcode::general
source: General
th_th: ทั่วไป

# SettingsOptions::barcode::elm_image
source: Image
th_th: รูปภาพ

# SettingsOptions::barcode::elm_image_info
source: Example Image
th_th: ภาพตัวอย่าง

# SettingsOptions::barcode::elm_configs
source: Configs
th_th: องค์ประกอบ

# SettingsOptions::barcode::type
source: Type
th_th: ประเภท

# SettingsOptions::barcode::output
source: Output
th_th: เอาต์พุต

# SettingsOptions::barcode::text
source: Text
th_th: ข้อความ

# SettingsOptions::barcode::height
source: Height,px
th_th: ความสูง px

# SettingsOptions::barcode::width
source: Width,px
th_th: ความกว้าง px

# SettingsOptions::barcode::resolution
source: Resolution
th_th: ความละเอียด

# SettingsOptions::barcode::text_font
source: Text Font
th_th: แบบอักษร

# SettingsOptions::barcode::prefix
source: Barcode prefix
th_th: นำหน้าบาร์โค้ด

# SettingsOptions::barcode::elm_specification
source: Specification
th_th: ข้อมูลจำเพาะ

# SettingsOptions::barcode::elm_spec_descr
source: Spec Description
th_th: คำอธิบายข้อมูลจำเพาะ

# SettingsVariants::barcode::type::C128A
source: Code 128-A
th_th: รหัส 128 A

# SettingsVariants::barcode::type::C128B
source: Code 128-B
th_th: รหัส 128-B

# SettingsVariants::barcode::type::C128C
source: Code 128-C
th_th: รหัส 128 C

# SettingsVariants::barcode::type::I25
source: Interleaved 2 of 5
th_th: แทรก 2 จาก 5

# SettingsVariants::barcode::type::C39
source: Code 39
th_th: รหัส 39

# SettingsVariants::barcode::output::png
source: Portable Network Graphics (PNG)
th_th: PNG

# SettingsVariants::barcode::output::jpeg
source: Joint Photographic Experts Group (JPEG)
th_th: JPEG

# SettingsVariants::barcode::text::N
source: Disabled
th_th: ถูกปิดใช้งาน

# SettingsVariants::barcode::text::Y
source: Enabled
th_th: ถูกเปิดใช้งาน
