Repository: INFORMATICS-SYSTEMS/garnenterprise.com
Catalog: var/langs/*/addons/bestsellers.po
Languages: th_th

# Addons::name::bestsellers
source: Bestsellers & On-Sale Products
th_th: ผลิตภัณฑ์ที่ขายดีและลดราคา

# Addons::description::bestsellers
source: Collects best selling & on sale product data and adds block fillings to show such products
th_th: รวบรวมสินค้าขายดีที่สุด และข้อมูลตัวสินค้าที่ลดราคา

# Languages::sort_by_bestsellers_asc
source: Sort by Bestselling: Low to High
th_th: ขายดีจัดเรียง: ต่ำไปสูง

# Languages::sort_by_bestsellers_desc
source: Sort by Bestselling
th_th: เรียงลำดับ สินค้าที่ขายดี

# Languages::sort_by_on_sale_asc
source: Sort by discount: Low to High
th_th: เรียงตามส่วนลด: ต่ำไปสูง

# Languages::sort_by_on_sale_desc
source: Sort by discount: High to Low
th_th: เรียงตามส่วนลด: สูงไปต่ำ

# Languages::sales_amount
source: Sales amount
th_th: ยอดขาย

# Languages::bestselling
source: Bestselling
th_th: ขายดี

# Languages::on_sale
source: On sale
th_th: ลดราคา

# Languages::similar
source: Similar
th_th: คล้ายกัน

# Languages::percent_range
source: Price range (in % of the main product's price)
th_th: ช่วงราคา (เป็น%ของราคาของผลิตภัณฑ์หลัก)

# Languages::similar_category
source: Of the same category
th_th: ประเภทเดียวกัน

# Languages::similar_subcats
source: Consider subcategories
th_th: พิจารณาประเภทย่อย

# Languages::similar_in_stock
source: Only "in stock" products
th_th: เฉพาะในสต็อก"ผลิตภัณฑ์

# Languages::final_sale
source: Final sale
th_th: ลดครั้งสุดท้าย

# SettingsSections::bestsellers::general
source: General
th_th: ทั่วไป

# SettingsSections::bestsellers::newest
source: Newest
th_th: ใหม่ล่าสุด

# SettingsOptions::bestsellers::final_sale_from
source: Minimum final sale discount (%)
th_th: ลดครั้งสุดท้ายที่ต่ำสุด (%)

# SettingsOptions::bestsellers::sales_amount_from
source: Minimum sales amount to define bestsellers
th_th: ยอดขายต่ำสุดที่กำหนดขายดี

# SettingsOptions::bestsellers::period
source: Period
th_th: รอบระยะเวลา

# SettingsOptions::bestsellers::last_days
source: Last days
th_th: วันสุดท้าย

# SettingsVariants::bestsellers::period::all
source: All days
th_th: ทุกวัน

# SettingsVariants::bestsellers::period::today
source: Today
th_th: วันนี้

# SettingsVariants::bestsellers::period::last_days
source: Last days
th_th: วันสุดท้าย
