Repository: INFORMATICS-SYSTEMS/garnenterprise.com
Catalog: var/langs/*/addons/blog.po
Languages: th_th

# Addons::name::blog
source: Blog
th_th: บล็อก

# Addons::description::blog
source: Lets you start your blog easily
th_th: ให้คุณเริ่มต้นการบล็อกของคุณได้อย่างง่ายดาย

# Languages::blog_menu_description
source: Manage your blog posts.
th_th: จัดการบล็อกของคุณ

# Languages::blog.new_post
source: New blog post
th_th: โพสต์บล็อกใหม่

# Languages::blog.editing_post
source: Editing blog post
th_th: แก้ไขบล็อก

# Languages::blog
source: Blog
th_th: บล็อก

# Languages::blog.add_post
source: Add blog post
th_th: เพิ่มบล็อกโพสต์

# Languages::blog.recent_posts
source: Blog: recent posts
th_th: บล็อก: โพสต์ล่าสุด

# Languages::blog.recent_posts_scroller
source: Blog: recent posts scroller
th_th: บล็อก: รายการโพสต์ล่าสุด

# Languages::blog.view_post
source: View post
th_th: ดูโพสต์

# Languages::recent_blog_posts
source: Recent blog posts
th_th: โพสต์บล็อกล่าสุด

# Languages::blog.posts
source: Posts
th_th: โพสต์

# Languages::blog.post
source: Post
th_th: โพสต์

# Languages::block_blog
source: Recent posts
th_th: โพสต์ล่าสุด

# Languages::blog.text_links
source: Blog: text links
th_th: บล็อก: เชื่อมโยงข้อความ

# Languages::blog.read_more
source: Read more
th_th: อ่านเพิ่มเติม

# Languages::post_description
source: Post description
th_th: คำอธิบายโพสต์

# Languages::ttc_post_description
source: Use the &lt;!--CUT--&gt; tag (switch to source code to insert it) to hide part of the post. Only the part above the tag is shown in the list of all posts.<br /><br />Make sure to <strong>close all HTML tags</strong> above the &lt;!--CUT--&gt; tag!
th_th: ใช้ &lt; ! -CUT--&gt; tag (สลับไปยัง source code เพื่อใส่) เพื่อซ่อนบางส่วนของโพสต์ เฉพาะส่วนที่เหนือแท็กจะปรากฏในรายการของโพสต์ทั้งหมด. < br / > < br / > ตรวจสอบว่า <strong> ปิดแท็ก HTML ทั้งหมด </strong> เหนือ &lt; ! -CUT--&gt; tag

# Languages::blog_functionality_notes
source: <p>Use this page to manage your blog. This is how you should organize your blog posts:</p><ul><li>Blog is a usual post that has the <b>Root level page</b> as the Parent page.</li><li>Choose <b>Blog</b> as the Parent page for your blog posts.</li></ul>
th_th: <p>ใช้เพจนี้เพื่อจัดการบล็อกของคุณ นี่คือวิธีที่คุณควรจัดระเบียบบล็อก: </p> <ul> <li>บล็อกคือโพสต์ปกติที่มี<b>หน้า Root Level </b>เป็นหน้าหลัก </li> <li>เลือก<b>บล็อก</b>เป็นหน้าหลักสำหรับบล็อก. </li> </ul>
