Repository: INFORMATICS-SYSTEMS/garnenterprise.com
Catalog: var/langs/*/addons/buy_together.po
Languages: th_th

# Addons::name::buy_together
source: Buy together
th_th: ซื้อรวมกัน

# Addons::description::buy_together
source: Allows you to set up share discounts on certain product combinations
th_th: ช่วยให้คุณสามารถตั้งค่า ส่วนลดผลิตภัณฑ์

# Languages::buy_together
source: Buy together
th_th: ซื้อรวมกัน

# Languages::specify_options
source: Specify options
th_th: ระบุตัวเลือก

# Languages::total_list_price
source: Total list price
th_th: รวมราคา

# Languages::price_for_all
source: Price for all
th_th: ราคาทั้งหมด

# Languages::add_all_to_cart
source: Add all to cart
th_th: เพิ่มสินค้าทั้งหมดลงในรถเข็น

# Languages::editing_combination
source: Editing combination
th_th: แก้ไขสินค้า

# Languages::buy_together_calculation_information
source: Total price: [total_price], Discount: [discount], Combination price: [combination_price]
th_th: ราคา: [total_price] ส่วนลด: [discount] ราคารวม: [combination_price]

# Languages::display_in_promotions
source: Display in promotions
th_th: แสดงในโปรโมชั่น

# Languages::combination_products
source: Combination products
th_th: ชุดผลิตภัณฑ์

# Languages::share_discount
source: Share discount
th_th: แบ่งปันส่วนลด

# Languages::buy_together_is_not_compatible_with_configurator
source: [product_name] cannot be added to combination. Buy together is not compatible with the Product configurator add-on
th_th: [product_name] ไม่สามารถเพิ่มชุด ซื้อกันไม่ได้กับ add-on ตัวจัดโครงแบบผลิตภัณฑ์

# Languages::buy_together_is_not_compatible_with_recurring_billing
source: [product_name] cannot be added to combination. Buy together is not compatible with the Recurring billing add-on
th_th: [product_name] ไม่สามารถเพิ่มชุด ซื้อกันไม่ได้กับ add-on เรียกเก็บเงินที่เกิดซ้ำ

# Languages::buy_together_combination_cannot_be_added
source: Combination cannot be added to cart
th_th: ไม่สามารถเพิ่มเข้าไปในรถเข็น

# Languages::buy_together_product_was_removed
source: [product] did not have enough amount ([amount]) and was removed from the cart
th_th: [product] ไม่มีจำนวนเพียงพอ ([amount]) และถูกเอาออกจากรถเข็น

# Languages::buy_together_fill_the_mandatory_fields
source: Please specify product options before adding this product combination to the cart.
th_th: โปรดระบุตัวเลือกผลิตภัณฑ์ก่อนที่จะเพิ่มชุดผลิตภัณฑ์นี้ในรถเข็น
