Repository: INFORMATICS-SYSTEMS/garnenterprise.com
Catalog: var/langs/*/addons/call_requests.po
Languages: th_th

# Addons::name::call_requests
source: Call requests
th_th: คำร้องขอให้ติดต่อกลับ

# SettingsSections::call_requests::general
source: General
th_th: ทั่วไป

# SettingsOptions::call_requests::general
source: General
th_th: ทั่วไป

# SettingsOptions::call_requests::phone
source: Rewrite phone
th_th: แก้หมายเลขโทรศัพท์

# SettingsOptions::call_requests::buy_now_with_one_click
source: Enable the "Buy now with one click" option
th_th: เปิดใช้ตัวเลือก "ซื้อเพียงคลิกเดียว"

# SettingsOptions::call_requests::order_status
source: Order status
th_th: สถานะของใบสั่ง

# SettingsTooltips::call_requests::phone_mask
source: Leave empty to use automatic country-based phone pattern, or type in a custom pattern. You can use spaces, commas, +, -, and digits. Note that 9 represents any digit; if you need a 9, type \\9. Examples: +9 (999) 999 99 99, 99999999, 999 999 99 or +99-99-9999-9999.
th_th: ปล่อยว่างถ้าจะใช้โทรศัพท์อัตโนมัติามรูปแบบในประเทศ หรือพิมพ์ในแบบที่กำหนดเอง คุณสามารถใช้ space, commas, +, -, และตัวเลข หมายเหตุ: ใช้ 9 แทนตัวเลขอื่น ถ้าคุณต้องการ 9, พิมพ์ \\9 ตัวอย่าง: +9 (999) 999 99 99, 99999999, 999 999 99 หรือ +99-9999-9999

# SettingsTooltips::call_requests::phone_prefix_length
source: Including parenthesis, spaces, etc. Use to highlight country code, area code, and phone prefix.
th_th: รวมทั้งวงเล็บ ช่องว่าง ฯลฯ ใช้เพื่อเน้นรหัสประเทศ รหัสพื้นที่ และค่านำหน้าของโทรศัพท์

# Languages::call_requests
source: Call requests
th_th: คำร้องขอให้ติดต่อกลับ

# Languages::call_requests_menu_description
source: Manage customer call requests
th_th: จัดการคำร้องขอให้ติดต่อกลับ

# Languages::call_requests.request_call
source: Request call
th_th: เรียกขอให้ติดต่อกลับ

# Languages::call_requests.buy_now_with_one_click
source: Buy now with 1-click
th_th: ซื้อตอนนี้ ด้วยคลิกเดียว

# Languages::call_requests.error_validate_call_form
source: Please enter your email or phone number
th_th: กรุณากรอกหมายเลขโทรศัพท์หรืออีเมล์

# Languages::call_requests.request_recieved
source: We have received your request! Our manager will contact you soon.
th_th: เราได้รับคำขอของคุณ ผู้จัดการของเราจะติดต่อคุณเร็ว ๆ นี้

# Languages::call_requests.order_placed
source: We have received your request! The order #[order_id] has been successfully created. Our manager will contact you soon.
th_th: เราได้รับคำขอของคุณ เราได้สร้างคำสั่งซื้อ #[order_id] เรียบร้อยแล้ว ผู้จัดการของเราจะติดต่อคุณเร็ว ๆ นี้

# Languages::call_requests.phone_from_settings
source: Phone from settings
th_th: การตั้งค่าโทรศัพท์

# Languages::call_requests.enter_phone_or_email_text
source: Please enter your phone number or email (for our manager to contact you)
th_th: กรุณากรอกหมายเลขโทรศัพท์หรืออีเมล์ (สำหรับให้ทางผู้จัดการของเราติดต่อคุณ)

# Languages::call_requests.status.new
source: New
th_th: ใหม่

# Languages::call_requests.status.in_progress
source: In progress
th_th: ระหว่างดำเนินการ

# Languages::call_requests.status.completed
source: Completed
th_th: เสร็จสมบูรณ์

# Languages::call_requests.status.no_answer
source: No answer
th_th: ไม่มีการตอบรับ

# Languages::call_requests.responsible
source: Responsible
th_th: รับผิดชอบ

# Languages::call_requests.notes
source: Notes
th_th: หมายเหตุ

# Languages::call_requests.requested_product
source: Requested product
th_th: ผลิตภัณฑ์ที่ร้องขอ

# Languages::call_requests.convenient_time
source: Convenient time
th_th: เวลาที่สะดวก

# Languages::call_requests.awaiting_call
source: Awaiting call
th_th: รอการติดต่อ

# Languages::call_requests.order_exists
source: Order exists
th_th: มีใบสั่ง

# Languages::call_requests.person_name_and_phone
source: Name and phone
th_th: ชื่อและโทรศัพท์

# Languages::call_requests.no_name_specified
source: No name specified
th_th: ไม่ระบุชื่อ

# Languages::call_requests.use_for_call_requests
source: Call request and buy now with one click form
th_th: คำร้องขอให้ติดต่อกลับ และแบบฟอร์มซื้อตอนนี้ด้วยคลิกเดียว

# Languages::block_call_request
source: Call request
th_th: คำร้องขอให้ติดต่อกลับ

# Languages::block_call_request_description
source: Store phone number and form for requesting a call
th_th: บันทึกหมายเลขโทรศัพท์และฟอร์มสำหรับการติดต่อกลับ

# Languages::tmpl_call_request
source: Call request form
th_th: แบบฟอร์มคำเรียกขอให้ติดต่อกลับ

# Languages::call_requests.text_call_request
source: Customer [customer] is <a href="[href]">awaiting your call</a> on [phone_number].
th_th: ลูกค้า [customer] <a href="[href]"> กำลังรอการติดต่อจากคุณ </a> ที่เบอร์ [phone_number].

# Languages::call_requests.text_call_request_call_time
source: The convenient call time is between [time_from] and [time_to].
th_th: เวลาสะดวกในการโทรคือระหว่าง [time_from] ถึง [time_to]

# Languages::call_requests.text_buy_with_one_click_request
source: Сustomer [customer] is <a href="[href]">awaiting your call</a> on [phone_number], regarding the purchase of the product <a href="[product_href]">[product_name]</a>.
th_th: ลูกค้า [customer] <a href="[href]">กำลังรอการติดต่อจากคุณ</a> ที่เบอร์ [phone_number] เกี่ยวกับการซื้อผลิตภัณฑ์ <a href="[product_href]">[product_name]</a>

# Languages::call_requests.error_validator_phone
source: The phone number in the <b>[field]</b> field is invalid.
th_th: หมายเลขโทรศัพท์ใน <b>[field]</b> ไม่ถูกต้อง

# Languages::email_template.call_requests_buy_with_one_click
source: Call requests: buy with one click notification
th_th: คำร้องขอให้ติดต่อกลับ: คำแจ้งเตือการซื้อเดี๋ยวนี้ด้วยคลิกเดียว

# Languages::email_template.call_requests_call_request
source: Call requests: call request notification
th_th: คำร้องขอให้ติดต่อกลับ: คำแจ้งเตือให้โทรกลับ

# Languages::call_request.work_time
source: Mon-Fr 9a.m.-6p.m.
th_th: จันทร์-ศุกร์ 9:00 น. - 18:00 น.
