Repository: INFORMATICS-SYSTEMS/garnenterprise.com
Catalog: var/langs/*/addons/catalog_mode.po
Languages: th_th

# Addons::name::catalog_mode
source: Catalog mode
th_th: แค็ตตาล็อกโหมด

# Addons::description::catalog_mode
source: Allows you to use the store as a product catalog
th_th: ช่วยให้คุณสามารถใช้เก็บเป็นแค็ตตาล็อกผลิตภัณฑ์

# Languages::catalog_mode
source: Catalog Mode
th_th: แค็ตตาล็อกโหมด

# Languages::text_catalog_mode_zero_price_action_notice
source: In order that the "Buy now" button could be displayed on the product details page, please set "Zero price action" as "Allow customers to add the product to cart".
th_th: /cs-cart-latest

# Languages::buy_now_url
source: Buy Now URL
th_th: ซื้อตอนนี้

# SettingsSections::catalog_mode::general
source: General
th_th: ทั่วไป

# SettingsOptions::catalog_mode::main_store_mode
source: Store operation mode
th_th: โหมดการจัดเก็บ

# SettingsOptions::catalog_mode::add_to_cart_empty_buy_now_url
source: Allow purchasing products with empty Buy Now URL
th_th: อนุญาตให้ซื้อผลิตภัณฑ์ ด้วยเปล่าซื้อตอนนี้

# SettingsVariants::catalog_mode::main_store_mode::catalog
source: Catalog
th_th: แค็ตตาล็อค

# SettingsVariants::catalog_mode::main_store_mode::store
source: Store
th_th: ร้านค้า
