Repository: INFORMATICS-SYSTEMS/garnenterprise.com
Catalog: var/langs/*/addons/paypal.po
Languages: th_th

# Addons::name::paypal
source: PayPal payments
th_th: ชำระเงินผ่าน Paypal

# Addons::description::paypal
source: Lets you accept payments via PayPal Express Checkout, PayPal Pro, PayPal Standard, PayPal Advanced, and PayPal Payflow Pro.
th_th: ช่วยให้คุณยอมรับการชำระเงินผ่าน PayPal Express, PayPal Pro, PayPal Standard, PayPal Advanced และ PayPal Payflow Pro

# SettingsOptions::paypal::override_customer_info
source: Override customer info
th_th: แทนข้อมูลลูกค้า

# SettingsOptions::paypal::test_mode
source: Test mode
th_th: โหมดทดสอบ

# SettingsSections::paypal::general
source: General
th_th: ทั่วไป

# Languages::protection_eligibility
source: Protection eligibility
th_th: การป้องกันสิทธิ

# SettingsOptions::paypal::paypal_ipn_settings
source: Instant payment notification settings
th_th: ตั้งค่าการแจ้งเตือนการชำระเงินทันที

# SettingsOptions::paypal::paypal_status_map
source: PayPal order status conversion map
th_th: แผนผังแปลงสถานะสั่งซื้อ PayPal

# SettingsOptions::paypal::paypal_logo_uploader
source: PayPal logo settings
th_th: การตั้งค่าโลโก้ PayPal

# Languages::text_paypal_surcharge
source: <b>Note:</b> According to the PayPal <a href='https://www.paypal.com/webapps/mpp/ua/useragreement-full#4' target='_blank'>policy</a> (4.6), surcharges are not supported.
th_th: <b>หมายเหตุ: </b> ตาม PayPal <a href='https://www.paypal.com/webapps/mpp/ua/useragreement-full#4' target='_blank'>นโยบาย</a> (4.6), ค่าธรรมเนียมไม่สนับสนุน

# Languages::txn_id
source: Transaction ID
th_th: รหัสธุรกรรม

# Languages::paypal_logo
source: PayPal logo
th_th: โลโก้ PayPal

# Languages::ttc_paypal_logo
source: Use a valid graphics format, such as .gif, .jpg, or .png. Limit the image to 190 pixels wide by 60 pixels high. PayPal crops images that are larger. PayPal places your logo image at the top of the cart review area.
th_th: ใช้รูปแบบกราฟิกที่ถูกต้อง เช่น.gif, .jpg, .png จำกัดภาพกว้าง 190 พิกเซลสูง 60 พิกเซล PayPal ครอบตัดรูปภาพที่มีขนาดใหญ่ PayPal สถานรูปโลโก้ของคุณที่ด้านบนของรถเข็นรีวิว

# Languages::ipn_errors
source: IPN errors
th_th: ข้อผิดพลาด IPN

# Languages::pp_product_count_is_incorrect
source: Number of paid items is different than the number of items in the order
th_th: จำนวนรายการจ่ายจะแตกต่างจากหมายเลขของสินค้าในใบสั่ง

# Languages::pp_currency_is_incorrect
source: Currency used for the payment is different than the order currency.
th_th: สกุลเงินที่ใช้สำหรับการชำระเงินจะแตกต่างจากสกุลเงินของใบสั่ง

# Languages::pp_total_is_incorrect
source: Payment total is different than the order total.
th_th: รวมการชำระเงินจะแตกต่างสั่งซื้อทั้งหมด

# Languages::pp_mode
source: Paypal mode
th_th: โหมด Paypal

# Languages::paypal_vendor
source: Vendor
th_th: ผู้จัดจำหน่าย

# Languages::paypal_use_in_context_checkout
source: Use In-Context Checkout
th_th: ใช้เช็คเอาท์ในบริบท

# Languages::ttc_paypal_use_in_context_checkout
source: In-Context Checkout will not be used when the store is running in Widget mode
th_th: เช็คเอาท์ในบริบทจะไม่ถูกใช้เมื่อทำงานในโหมดเครื่องมือเก็บ

# Languages::paypal_express_notice
source: A merchant ID is required for using <a href='https://developer.paypal.com/docs/classic/express-checkout/in-context' target='_blank'>In-Context Checkout feature</a> within this integration. You can look up your merchant ID by logging into <a href='https://www.paypal.com/' target='_blank'>https://www.paypal.com/</a>. Click the profile icon on the top right side of the page and then select <b>Profile and settings</b> in the <b>Business Profile</b> menu. (If you do not see the profile icon at the top of the page, click <b>Profile</b>, which appears in the top menu when the <b>My Account tab</b> is selected.) Click <b>My business info</b> on the left, and the <b>Merchant account ID</b> is displayed in the list of profile items on the right.
th_th: ผู้ขาย ID เป็นสิ่งจำเป็นสำหรับการใช้<a href='https://developer.paypal.com/docs/classic/express-checkout/in-context' target='_blank'>คุณสมบัติการชำระเงินในบริบท</a>ภายในนี้รวมกัน คุณสามารถค้นหาร้านค้าของคุณ ID โดยเข้าสู่ <a href='https://www.paypal.com/' target='_blank'>https://www.paypal.com/</a> คลิกไอคอนโพรไฟล์บนด้านขวาบนของหน้า และเลือก<b>ส่วนกำหนดค่าและการตั้งค่า</b>ในเมนู<b>โปรไฟล์ธุรกิจ</b> (ถ้าคุณไม่เห็นไอคอนส่วนกำหนดค่าที่ด้านบนของหน้า คลิก<b>โพรไฟล์</b> ซึ่งปรากฏในเมนูด้านบนเมื่อเลือก<b>แท็บบัญชีของฉัน</b>) คลิก<b>ข้อมูลธุรกิจของฉัน</b>บนซ้าย และ<b>รหัสบัญชีร้านค้า</b>จะแสดงในรายการของโพรไฟล์ด้านขวา

# Languages::paypal_ipn_note
source: Instant Payment Notification (IPN) is a service that automatically notifies merchants of events related to PayPal transactions.<br>When a customer places an order and chooses PayPal as the payment method, the order gets the <b>Open</b> status.<br>PayPal then sends Instant Payment Notification messages that include the transaction status. This status changes the order status in your store according to the status conversion map.
th_th: แจ้งชำระเงินทันที (IPN) เป็นบริการที่ร้านค้าของเหตุการณ์ที่เกี่ยวข้องกับธุรกรรมของ PayPal ที่จะแจ้งให้ทราบโดยอัตโนมัติ <br>เมื่อลูกค้าทำการสั่งซื้อ และเลือก PayPal เป็นวิธีการชำระเงิน ใบสั่งได้รับสถานะเป็น<b>เปิด</b> <br> PayPal แล้วส่งข้อความแจ้งทันทีที่มีสถานะธุรกรรม สถานะนี้เปลี่ยนสถานะใบสั่งในร้านค้าของคุณตามสถานะการแปลงแผนที่

# Languages::paypal_ipn_transaction_status
source: Transaction status
th_th: สถานะของธุรกรรม

# Languages::addons.paypal.surcharge_policy_notice
source: Surcharge has been set for the payment method that uses PayPal Services. Please make sure this complies with the <a href="https://www.paypal.com/webapps/mpp/ua/legalhub-full" target="_blank">User Agreement for PayPal Services</a> for your region.
th_th: มีการตั้งค่าสำหรับวิธีการชำระเงินที่ใช้บริการ PayPal โปรดตรวจสอบว่า นี้สอดคล้องกับข้อ<a href="https://www.paypal.com/webapps/mpp/ua/legalhub-full" target="_blank">ตกลงผู้ใช้บริการ PayPal</a>สำหรับภูมิภาคของคุณ

# Languages::addons.paypal.rma.perform_refund
source: Give a refund via PayPal
th_th: คืนเงินผ่านทาง PayPal

# Languages::ttc_addons.paypal.rma.perform_refund
source: A refund will be made once an administrator changes the return request status
th_th: จะคืนเงินเมื่อผู้ดูแลระบบเปลี่ยนสถานะการขอคืน

# Languages::addons.paypal.rma.refund_performed
source: The refund has been made via PayPal
th_th: ได้รับเงินคืนผ่านทาง PayPal

# Languages::addons.paypal.refund_message
source: [amount] [currency] have been refunded in [date] at [time].
th_th: [amount] [currency] ได้รับเงินคืนใน [date] ที่ [time]

# SettingsOptions::paypal::paypal_partial_refund_action
source: Order status on partial refund
th_th: สถานะใบสั่งคืนเงินบางส่วน

# Languages::addons.paypal.do_not_change
source: Do not change
th_th: ไม่เปลี่ยนแปลง

# Languages::tt_addons_paypal_settings_partial_refund_action_order_status
source: Determines whether or not to change the order status automatically after a partial refund via PayPal.
th_th: กำหนดว่าการเปลี่ยนสถานะของใบสั่งโดยอัตโนมัติหลังจากคืนเงินบางส่วนผ่าน PayPal หรือไม่

# Languages::addons.paypal.set_status_to
source: Set to:
th_th: ตั้งเป็น:

# Languages::addons.paypal.ipn_receiving_time
source: IPN receiving time
th_th: เวลารับ IPN

# Languages::addons.paypal.status_for_new_orders
source: Initial order status
th_th: สถานะการสั่งซื้อครั้งแรก

# Languages::ttc_addons.paypal.status_for_new_orders
source: All orders with a PayPal payment method get this status until the response from PayPal (an IPN message) arrives or a customer returns to the store via a link on the PayPal site.
th_th: ใบสั่งทั้งหมดพร้อมวิธีการชำระเงิน PayPal ได้รับสถานะนี้จนมาถึงการตอบสนองจาก PayPal (ข้อ IPN) หรือลูกค้าที่ส่งคืนไปยังที่เก็บผ่านทางการเชื่อมโยงเว็บไซต์ PayPal

# Languages::addons.paypal.status_for_new_orders.open
source: By default, the <i>Open</i> status decreases the inventory, so two customers won't be able to buy the same product while the payment is being processed by PayPal. But if a customer leaves the PayPal website without paying or returning to the store via a link on the PayPal site, you'll have an abandoned <i>Open</i> order with reserved products.
th_th: โดยค่าเริ่มต้น สถานะ<i>เปิด</i>ลดสินค้าคงคลัง ลูกค้าสองจะไม่สามารถซื้อผลิตภัณฑ์เดียวกันในขณะที่กำลังประมวลผลการชำระเงิน ด้วย PayPal แต่ถ้าลูกค้าใบเว็บไซต์ PayPal โดยไม่มีการจ่ายเงิน หรือกลับไปยังที่เก็บผ่านทางการเชื่อมโยงเว็บไซต์ PayPal คุณจะมีการทิ้ง<i>เปิด</i>สั่งจองผลิตภัณฑ์

# Languages::addons.paypal.status_for_new_orders.incomplete
source: This ensures that you won't have abandoned unpaid orders with the <i>Open</i> status and reserved products. But until the response from PayPal (an IPN message) arrives or the customer returns to the store via a link on the PayPal site, the order will be listed as <i>Incomplete</i>, and products won't be reserved.
th_th: แน่ใจว่า คุณจะไม่ได้ทอดทิ้งยังไม่ได้ชำระใบสั่ง มีสถานะ<i>เปิด</i>และผลิตภัณฑ์สำรอง แต่จนมาถึงการตอบสนองจาก PayPal (ข้อ IPN) หรือลูกค้ากลับไปยังที่เก็บผ่านทางการเชื่อมโยงเว็บไซต์ PayPal ใบสั่งจะถูกแสดงเป็น<i>ไม่สมบูรณ์</i> และผลิตภัณฑ์จะไม่สามารถจอง

# Languages::addons.paypal.display_name
source: Display name
th_th: ชื่อที่แสดง

# Languages::addons.paypal.display_description
source: Display description
th_th: แสดงคำอธิบาย

# Languages::addons.paypal.technical_details
source: Technical details
th_th: รายละเอียดทางเทคนิค

# Languages::addons.paypal.connect_to_paypal
source: Connect to PayPal
th_th: เชื่อมต่อกับ PayPal

# Languages::addons.paypal.use_buttons_to_signup
source: Use these buttons to complete the configuration wizard
th_th: ใช้ปุ่มเหล่านี้เพื่อดำเนินการตัวช่วยสร้างการกำหนดค่า

# Languages::addons.paypal.configure_live
source: Configure Live
th_th: กำหนดถ่ายทอดสด

# Languages::addons.paypal.configure_test
source: Configure Test
th_th: กำหนดค่าทดสอบ

# Languages::addons.paypal.connecting_to_signup_server
source: Connecting to <b>PayPal Sign Up Server</b>...
th_th: เชื่อมต่อกับ<b>เซิร์ฟเวอร์สมัคร PayPal</b>...

# Languages::addons.paypal.signup_completed
source: The <b>[payment]</b> payment method has been successfully configured
th_th: วิธีการชำระเงินของ <b>[payment]</b> ได้ถูกกำหนดค่าเรียบร้อยแล้ว

# Languages::addons.paypal.signup_errors.signup_init
source: An error occurred when connecting to a PayPal account
th_th: เกิดข้อผิดพลาดเมื่อเชื่อมต่อกับบัญชี PayPal

# Languages::addons.paypal.signup_errors.merchant_credentials
source: An error occurred when obtaining the payment method configuration
th_th: ข้อผิดพลาดเกิดขึ้นเมื่อได้รับการกำหนดค่าวิธีการชำระเงิน
