Repository: INFORMATICS-SYSTEMS/garnenterprise.com
Catalog: var/langs/*/addons/reward_points.po
Languages: th_th

# Addons::name::reward_points
source: Reward points
th_th: คะแนนสะสม

# Addons::description::reward_points
source: Lets customers earn and spend points for purchases
th_th: ช่วยให้ลูกค้าได้รับ และใช้แต้มสำหรับการซื้อ

# Languages::reward_points
source: Reward points
th_th: คะแนนสะสม

# Languages::reward_points_log
source: Reward points log
th_th: ระบบคะแนนสะสม

# Languages::reward_points_menu_description
source: Assign global reward points in your store.
th_th: กำหนดคะแนนสะสม ในร้านค้าของคุณ

# Languages::promotion_cond_reward_points
source: Points on user account
th_th: คะแนนบนบัญชีผู้ใช้

# Languages::points
source: Points
th_th: คะแนน

# Languages::points_in_use
source: Points in use
th_th: คะแนนในการใช้

# Languages::points_in_use_lower
source: points in use
th_th: คะแนนในการใช้

# Languages::points_lower
source: points
th_th: คะแนน

# Languages::points_in_use_lowercase
source: [n] point in use|[n] points in use
th_th: [n] คะแนนในการใช้ [n] คะแนนในการใช้

# Languages::points_lowercase
source: [n] point|[n] points
th_th: [n] คะแนน | คะแนน [n]

# Languages::points_to_use
source: Points to use
th_th: คะแนนที่จะใช้

# Languages::point_payment
source: Point payment
th_th: จุดชำระเงิน

# Languages::point_price
source: Price in points
th_th: ราคาในคะแนน

# Languages::text_increase_points_in_use
source: The points used in the order were added to user account.
th_th: คะแนนที่ใช้ในใบสั่งถูกเพิ่มไปยังบัญชีผู้ใช้

# Languages::text_points_used_in_order
source: Points were used in order
th_th: คะแนนที่ถูกใช้ตามลำดับ

# Languages::text_point_in_account
source: You have
th_th: คุณมี

# Languages::pay_by_points
source: Allow payment by points
th_th: อนุญาตชำระเงินโดยใช้คะแนน

# Languages::override_gc_points_brief
source: Override global/category points
th_th: แทนที่คะแนนใช้งาน

# Languages::text_points_exceed_points_on_account
source: The number of the points entered by you exceeds the number of points at your account.
th_th: จำนวนคะแนนที่คุณป้อนเกินกว่าจำนวนคะแนนในบัญชีของคุณ

# Languages::text_points_exceed_points_that_can_be_applied
source: The number of points entered by you exceeds the number of points that can be applied to this order.
th_th: จำนวนคะแนนที่คุณป้อนเกินจำนวนจุดที่สามารถใช้กับใบสั่งนี้

# Languages::text_points_cannot_applied_because_subtotal_redeemed
source: Points cannot be applied because the subtotal is completely redeemed.
th_th: ไม่สามารถใช้คะแนน เนื่องจากผลรวมย่อยทั้งหมดถูกแลก

# Languages::text_cannot_apply_points_to_this_order_because_total
source: Unfortunately, you cannot apply points to this order, because the total cost is zero.
th_th: คุณไม่สามารถใช้คะแนนนี้สั่งซื้อ เนื่องจากต้นทุนรวมเป็นศูนย์

# Languages::text_cannot_apply_points_to_this_order_because_user
source: Unfortunately, you cannot apply points to this order, because you do not have enough points at the account.
th_th: คุณไม่สามารถใช้คะแนนนี้สั่งซื้อ เนื่องจากคุณมีคะแนนไม่เพียงพอ

# Languages::text_order_status_has_not_been_changed
source: The order status has not been changed, because the user did not have enough points.
th_th: สถานะของการสั่งซื้อไม่เปลี่ยนแปลง เพราะผู้ใช้มีคะแนนไม่เพียงพอ

# Languages::price_in_points_increased
source: Price in points has been increased by
th_th: ราคาในคะแนนที่เพิ่มขึ้นโดย

# Languages::price_in_points_decreased
source: Price in points has been decreased by
th_th: ราคาในคะแนนที่ลดลงโดย

# Languages::earned_points
source: Points earned per product
th_th: คะแนนที่ได้รับต่อผลิตภัณฑ์

# Languages::override_g_points
source: Override global point value for all products in this category
th_th: แทนค่าคะแนนทั่วโลกสำหรับผลิตภัณฑ์ทั้งหมดในหมวดนี้

# Languages::amount_type
source: Amount type
th_th: ชนิดจำนวน

# Languages::maximum
source: Maximum
th_th: สูงสุด

# Languages::earned_point_modifier
source: Earned point modifier
th_th: ปรับเปลี่ยนคะแนนได้

# Languages::override_gc_points
source: Override global/category point value for this product
th_th: แทนค่าคะแนนใช้งานสำหรับผลิตภัณฑ์นี้

# Languages::view_user_points
source: View user points
th_th: ดูคะแนนผู้ใช้งาน

# Languages::log
source: Log
th_th: รายการที่บันทึกไว้

# Languages::subtract
source: Subtract
th_th: ลบ

# Languages::change_points
source: Change points
th_th: เปลี่ยนแปลงคะแนน

# Languages::add_subtract_points
source: Add & subtract points
th_th: เพิ่ม และลบคะแนน

# Languages::cleanup_log
source: Cleanup log
th_th: ล้างข้อมูลที่บันทึก

# Languages::we_would_like_to_inform
source: We would like to inform you that
th_th: เราอยากแจ้งให้ทราบว่า

# Languages::reward_points_subj_added_to
source: [n] point have been added to your account.|[n] points have been added to your account.
th_th: เพิ่มคะแนน [n] บัญชีของคุณ. | คะแนน [n] เพิ่มบัญชีของคุณ

# Languages::reward_points_subj_subtracted_from
source: [n] point have been subtracted from your account.|[n] points have been subtracted from your account.
th_th: [n] หักคะแนนจากบัญชีของคุณ. | [n] หักคะแนนจากบัญชีของคุณ

# SettingsSections::reward_points::general
source: General
th_th: ทั่วไป

# SettingsOptions::reward_points::point_rate
source: Points Exchange Rate (PER - the number of points equal to 1 conventional unit)
th_th: ชี้อัตราแลกเปลี่ยนคะแนน (ต่อ - จำนวนจุดเท่ากับ 1 หน่วยทั่วไป)

# SettingsOptions::reward_points::auto_price_in_points
source: "Price in points" is calculated automatically on PER basis
th_th: "ราคาในคะแนนที่" มีคำนวณโดยอัตโนมัติในเกณฑ์

# SettingsOptions::reward_points::price_in_points_with_discounts
source: "Price in points" is recalculated taking into account discounts
th_th: "ราคาในคะแนนที่" จะถูกคำนวณเป็นส่วนลดในบัญชี

# SettingsOptions::reward_points::points_with_discounts
source: "Points" is recalculated taking into account discounts
th_th: "คะแนน" จะถูกคำนวณเป็นส่วนลดในบัญชี

# SettingsOptions::reward_points::price_in_points_order_discount
source: "Price in points" is recalculated taking into account order discounts
th_th: "ราคาในคะแนนที่" จะถูกคำนวณเป็นส่วนลดในบัญชี

# SettingsOptions::reward_points::reward_points_order_discount
source: "Points" is recalculated taking into account order discounts
th_th: "คะแนน" จะถูกคำนวณเป็นส่วนลดในบัญชี

# SettingsOptions::reward_points::higher_level_extract
source: If the product and the product category do not have defined reward points but the higher level category has such reward points, extract data from it
th_th: ถ้าสินค้าและประเภทสินค้าไม่มีคะแนนสะสมที่กำหนดไว้ แต่ประเภทระดับสูงได้คะแนนสะสมดังกล่าว ดึงข้อมูลจากมัน

# SettingsOptions::reward_points::several_points_action
source: If several reward points can be applied, set
th_th: ถ้าสามารถใช้คะแนนสะสมกับหลายรายการ

# SettingsOptions::reward_points::consider_zero_values
source: Apply zero reward point values
th_th: ใช้คะแนนทั้งหมดแลกของรางวัล

# SettingsOptions::reward_points::log_per_page
source: Log lines per page
th_th: บันทึกบรรทัดต่อหน้า

# SettingsTooltips::reward_points::consider_zero_values
source: The reward points rules with the zero values should be considered
th_th: ควรพิจารณากฎคะแนนรางวัลที่ มีค่าเป็นศูนย์

# SettingsVariants::reward_points::several_points_action::minimal_absolute
source: Absolute minimal value
th_th: ค่าต่ำสุดสัมบูรณ์

# SettingsVariants::reward_points::several_points_action::minimal_percentage
source: Minimal percentage value
th_th: ค่าเปอร์เซ็นต์ที่น้อยที่สุด

# SettingsVariants::reward_points::several_points_action::maximal_absolute
source: Absolute maximal value
th_th: ค่าสูงสุดสัมบูรณ์

# SettingsVariants::reward_points::several_points_action::maximal_percentage
source: Maximal percentage value
th_th: ค่าเปอร์เซ็นต์ที่มากที่สุด

# Languages::email_template.reward_points_notification
source: Reward points
th_th: คะแนนสะสม

# Languages::grant_point
source: Grant reward points
th_th: ให้คะแนนสะสม
