Repository: INFORMATICS-SYSTEMS/garnenterprise.com
Catalog: var/langs/*/addons/suppliers.po
Languages: th_th

# Addons::name::suppliers
source: Suppliers
th_th: ซัพพลายเออร์

# Addons::description::suppliers
source: Adds supplier assignment support to products
th_th: เพิ่มการสนับสนุนการกำหนดผู้จัดจำหน่ายผลิตภัณฑ์

# Languages::search_by_supplier
source: Search by supplier
th_th: ค้นหา โดยจัดจำหน่าย

# Languages::notify_supplier
source: Notify supplier
th_th: แจ้งผู้จัดจำหน่าย

# Languages::view_supplier_products
source: View supplier products
th_th: ผู้จำหน่ายผลิตภัณฑ์

# Languages::supplier
source: Supplier
th_th: ผู้จัดจำหน่าย

# Languages::supplier_email_header
source: The following products have been purchased in our store and need to be shipped.
th_th: ผลิตภัณฑ์ต่อไปนี้มีการสั่งซื้อในร้านของเรา และต้องการจัดส่ง

# Languages::suppliers_menu_description
source: List of supplier accounts registered in the store.
th_th: รายการของบัญชีผู้จัดจำหน่ายที่ลงทะเบียนใน store

# Languages::dear_sirs
source: Dear Sirs
th_th: เรียนท่านที่เคารพ

# Languages::add_supplier
source: Add supplier
th_th: เพิ่มผู้จัดจำหน่าย

# Languages::available_for_supplier
source: Available for supplier
th_th: สำหรับผู้จัดจำหน่าย

# Languages::editing_supplier
source: Editing supplier
th_th: แก้ไขผู้จัดจำหน่าย

# Languages::supplier_deleted
source: Supplier has been deleted successfully.
th_th: ผู้ถูกลบเรียบร้อย

# SettingsSections::suppliers::general
source: General
th_th: ทั่วไป

# SettingsOptions::suppliers::display_supplier
source: Display product supplier company
th_th: บริษัทจำหน่ายผลิตภัณฑ์จอแสดงผล

# SettingsOptions::suppliers::display_shipping_methods_separately
source: Display shipping methods to each supplier separately
th_th: แสดงวิธีการจัดส่งให้ผู้ขายแต่ละแยกต่างหาก

# Languages::email_template.suppliers_notification
source: Supplier notification
th_th: แจ้งเตือนผู้จัดจำหน่าย

# Languages::template_document_supplier_order_invoice
source: Suppliers: invoice
th_th: ผู้จำหน่าย: ใบแจ้งหนี้

# Languages::document_preview_suppliers_not_found
source: Couldn't find a supplier. Preview only works with existing data. Please create a supplier and use Preview again.
th_th: ไม่สามารถหาผู้จัดจำหน่าย ตัวอย่างทำงานกับข้อมูลที่มีอยู่เท่านั้น กรุณาสร้างผู้จัดจำหน่าย และใช้ตัวอย่างอีกครั้ง
